let username = "admin" // ตั้งตัวเเปรชื่อผู้ใช้ //
let password = 1234; // ตั้งตัวเเปรหัสผ่าน //
let age = 19; // ตั้งตัวเเปรอายุ //

if  (username == "admin" && password == 1234 && age >= 18) { // บรรดทัดนี้จะใช้ if เพื่อเช็คเงื่อนไชเรกว่า username เเละ password เเละ age ถุกต้องไหม // 
console.log("เข้าใช้งานระบบได้"); // ถ้าเงื่อนไขถูกต้อง ก็ปริ้นข้อความว่า เข้าใช้งานระบบได้ ถ้าไม่เข้าเงือนไขนี้ ก็จะทำอันต่อไป//
} else if (username != "admin" || password != 1234 ) { // บรรทัดนี้จะ้ใช้ else if เพื่อเช็คเงื่อนไขว่า username หรือ password ผิดหรือไม่ //
console.log("ชื่อหรื่อรหัสผ่านไม่ถูกต้อง"); // ถ้าเงือนไขถูกต้อง ก็ปริ้นข้อความว่า ชื่อหรื่อรหัสผ่านไม่ถูกต้อง ถ้าไม่ก็จะทำอันต่อไป //
} else if (age < 18) { // บรรทัดนี้จะเช็คว่า อายุมากกว่า 18 ไหม ถ้าใช่ ก็จะยังจะสามารถเข้าใช้งานได้ ้้ต่ต้องกลีบไปดูเงือนไที่ 1 กับ 2 ว่าเข้าเงือนไขไหน ถ้าอายุน้อยกว่า ก็จะปริ้นคำว่า อายุไม่ถึงเกณฑ์// 
console.log("อายุไม่ถึงเกณฑ์");
}
 

