let math = 85 // ตั้งตัวแปรวิชาาคณิค พร้อมกับใส่ค่า // 
let sciene = 72 // ตั้งตัวแปรวิชาวิทยาศาสตร์ พร้อมกับใส่ค่า //
let english = 90 // ตั้งตัวแปรวิชาภาษาอังกฤษ พร้อมกับใส่ค่า //

console.log("score sum =", math + sciene + english); // บรรทัดนี้เป็นการทำปริ้น พร้อมกับผลรวมของคะเเนนทั้งหมด //
console.log("score avergae =", (math + sciene + english) /3 ); // บรรทัดนี้เป็นการทำปริ้น พร้อมกับทำค่าเฉลี่ยของคะเเนนทั้งหมด โดยเอาผลรวมคะเเนน ไปหาร 3
console.log("score average =", (math + sciene + english) /3 > 80); // บรรทัดนี้เป็นการทำปริ้น เเละทำการรวมคะเเนนเฉลี่ย โดยจะเช็คว่าคะเเนนมากกว่า 80 ไหม // 


